#include <iostream>

const unsigned int rows = 3, cols = 4;

unsigned int Theseus(int lab[rows][cols], int x, int y) {

//------------------------------------------------------------------------------------------
    //Дъно на рекусрията
//------------------------------------------------------------------------------------------

    if (x >= rows || y >= cols || x < 0 || y < 0) return 0;
    if (lab[x][y] == -1) return 0;
    if (lab[x][y] == 2) return 1;


//------------------------------------------------------------------------------------------
    //Маркиране като посетено
//------------------------------------------------------------------------------------------

    lab[x][y] = -1;

//------------------------------------------------------------------------------------------
    //Проверка във всички посоки
//------------------------------------------------------------------------------------------

    int dx[4] = {1, 0 , -1, 0}, dy[4] = {0, 1, 0, -1};

    unsigned counter = 0;
    for (unsigned int i = 0; i < 4; ++i)
        counter += Theseus(lab, x + dx[i], y + dy[i]);

//------------------------------------------------------------------------------------------
    //Размаркиране на минатата клетка (Backtracking)
//------------------------------------------------------------------------------------------

    lab[x][y] = 0;

    return counter;

}

unsigned int Find_Start(int lab[rows][cols]) {
    for (unsigned int i = 0; i < rows; ++i)
        for (unsigned int j = 0; j < cols; ++j)
            if (lab[i][j] == 1) return Theseus(lab, i, j);
    return 0;
}


void main() {
    
    int lab[rows][cols] = {
        {1, 0, 0, 0},
        {0, 0, 0, 0},
        {0, 0, 2, -1}
    };

	std::cout << Find_Start(lab);
}